%%第一节
clear;%清空工作区
clc;%清空命令行 
%ctrl+r批量注释; ctrl+t批量解除
% iskeyword;%查看关键字,特殊变量：ans,pi,inf/-inf无穷
%分号决定是否显示结果在命令行窗口
x6 = 10;
y = 6;
% x6 / y;
xy=x6 ^ y;

%字符和字符串
ch1='a';
ch2='b';
ch=ch1+ch2; %ASCII数值相加
str = "Hello World！";

%矩阵
%列与列之间‘，’或者空格分隔
%行与行之间分号或者换行分隔
m=[1,2,3;4,5,6];
n=[1 2 3
    4 5 6];
if m==n
    isbool=true;
else
    isbool=false;
end

a=zeros(100);%全是0
% a=ones(100);%全是1
% a=eye(100);%单位矩阵
b=zeros(100,90);%可改大小

c=rand(2,5);%随机数
d=randi(6,10);%随机整数
%(最大值,方阵大小)
e=randn(10);%正态分布
touzi=randi([1,6],1,20);%20次投骰子
%(范围,行数,列数)




%矩阵修改
m(2,3)=0;%单个索引修改
m(2,:)=0;%整行修改
%等号右边如果是[]，则删除范围元素
m([1,2],[2,3])=0;%范围修改，一二行里面的二三列
%m
%线性索引修改
n(3)=0;
n(5,6)=8;
% n
%如果索引（不管是否线性）不存在，则拓展矩阵，其余元素为0



%矩阵拼接
x1=eye(4);
x2=ones(4);
x3=cat(1,x1,x2,x1);%纵向拼接
x4=cat(2,x1,x2);%横向拼接


%矩阵重构
x11=reshape(x1,2,8);%先转成一维线性，再重构列和行，并不能删除元素，必须保持数量一致
x12=reshape(x1,8,[]);%也可以不写行或者列，系统自动计算，但是数量要一致
x13=sort(c,1,"ascend");%列排序，升序（默认）
x14=sort(c,2,"descend");%行排序，降序（加"descend"）
x15=sortrows(c,2,"descend");%对某行或者某列排序"某一科成绩排序"
x16=sortrows(c,[1,3]);%如果第一列相同，按第三列大小排序

%%第二节：矩阵运算
%双百分号表示分节，Ctrl+U可以只运行下面的脚本
% clear;
% clc;
a=[1,2,3;4,6,7];
b=[7,8,9;10,11,12];
a1=sum(a,1);%行相加
a2=sum(a,2);%列相加
a3=sum(a,"all");%全部相加
a4=a(:);%矩阵转向量
a5=prod(a,"all");%乘积函数同理
a6=cumsum(a);

res1=a*4;
res2=a+4;
res3=a+b;
res4=a+[6;5];
res5=a+[3,9,6];
res6=[2
    5]+[1,8,3];
%矩阵相加减，一定是矩阵大小相同的相加减，不满足但兼容的复制元素（单个、列、行）相加减
%res6相当于repmat(矩阵,行数,列数)重复拼接：
res7=repmat([2;5],1,3)+repmat([1,8,3],2,1);

A=randi(10,3,4);
B=randi(10,4,4);
res8 = A * B;%乘运算
% res9 = A .* B;%点乘运算,依旧是数量不够的情况下，复制元素
%矩阵除法、乘方，/  ./  ^  .^
%矩阵转置
if [1:3]'==[1;2;3]
    isbool=true;
else
    isbool=false;
end

